<p>
    Ёжик может встретить в тумане либо Сивого Мерина, либо Сивую Кобылу, либо своего друга Медвежонка. Однажды Ёжику
    вышли навстречу все трое, но туман был густой, и Ёжик не видел, кто из них кто, а потому попросил
    представиться.<br />
    Тот, кто, с точки зрения Ёжика, был слева, сказал: «Рядом со мной Медвежонок».<br />
    Тот, кто стоял справа, заявил: «Это тебе сказала Сивая Кобыла».<br />
    Наконец, тот, кто был в центре, сообщил: «Слева от меня Сивый Мерин».<br />
    Определите, кто где стоял, если известно, что Сивый Мерин врёт всегда, Сивая Кобыла — иногда, а Медвежонок Ёжику не
    врёт никогда?
</p>